---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
source: html/99617fc8-6def-132d-3794-162b8b4522db.htm
---
# StructuralSectionRectangular Properties

Common set of parameters for structural analysis.